/*
 * Copyright 2011-2016 MSUN.com All right reserved. This software is the confidential and proprietary information of
 * MSUN.com ("Confidential Information"). You shall not disclose such Confidential Information and shall use it only in
 * accordance with the terms of the license agreement you entered into with MSUN.com.
 */
package com.mmj.app.common.util;

import java.lang.reflect.Type;
import java.util.ArrayList;
import java.util.Collections;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import com.google.gson.Gson;
import com.google.gson.GsonBuilder;
import com.google.gson.JsonElement;
import com.google.gson.JsonPrimitive;
import com.google.gson.JsonSerializationContext;
import com.google.gson.JsonSerializer;
import com.google.gson.reflect.TypeToken;

/**
 * @author zxc Nov 30, 2014 6:20:03 PM
 */
public class CityUtils {

    final static String                       CITY =
                                                   // 所有省
                                                   "[{\"id\":0,\"data\":[{\"id\":10101,\"name\":\"北京\"},{\"id\":10102,\"name\":\"上海\"},{\"id\":10103,\"name\":\"天津\"},{\"id\":10104,\"name\":\"重庆\"},{\"id\":10105,\"name\":\"黑龙江\"},{\"id\":10106,\"name\":\"吉林\"},{\"id\":10107,\"name\":\"辽宁\"},{\"id\":10108,\"name\":\"内蒙古\"},{\"id\":10109,\"name\":\"河北\"},{\"id\":10110,\"name\":\"山西\"},{\"id\":10111,\"name\":\"陕西\"},{\"id\":10112,\"name\":\"山东\"},{\"id\":10113,\"name\":\"新疆\"},{\"id\":10114,\"name\":\"西藏\"},{\"id\":10115,\"name\":\"青海\"},{\"id\":10116,\"name\":\"甘肃\"},{\"id\":10117,\"name\":\"宁夏\"},{\"id\":10118,\"name\":\"河南\"},{\"id\":10119,\"name\":\"江苏\"},{\"id\":10120,\"name\":\"湖北\"},{\"id\":10121,\"name\":\"浙江\"},{\"id\":10122,\"name\":\"安徽\"},{\"id\":10123,\"name\":\"福建\"},{\"id\":10124,\"name\":\"江西\"},{\"id\":10125,\"name\":\"湖南\"},{\"id\":10126,\"name\":\"贵州\"},{\"id\":10127,\"name\":\"四川\"},{\"id\":10128,\"name\":\"广东\"},{\"id\":10129,\"name\":\"云南\"},{\"id\":10130,\"name\":\"广西\"},{\"id\":10131,\"name\":\"海南\"},{\"id\":10132,\"name\":\"香港\"},{\"id\":10133,\"name\":\"澳门\"},{\"id\":10134,\"name\":\"台湾\"}]}"
                                                           // 北京
                                                           + ",{\"id\":10101,\"data\":[{\"id\":1,\"name\":\"北京\"},{\"id\":2,\"name\":\"海淀\"},{\"id\":3,\"name\":\"朝阳\"},{\"id\":4,\"name\":\"顺义\"},{\"id\":5,\"name\":\"怀柔\"},{\"id\":6,\"name\":\"通州\"},{\"id\":7,\"name\":\"昌平\"},{\"id\":8,\"name\":\"延庆\"},{\"id\":9,\"name\":\"丰台\"},{\"id\":10,\"name\":\"石景山\"},{\"id\":11,\"name\":\"大兴\"},{\"id\":12,\"name\":\"房山\"},{\"id\":13,\"name\":\"密云\"},{\"id\":14,\"name\":\"门头沟\"},{\"id\":15,\"name\":\"平谷\"},{\"id\":16,\"name\":\"西城\"},{\"id\":17,\"name\":\"东城\"}]}"
                                                           // 上海
                                                           + ",{\"id\":10102,\"data\":[{\"id\":1,\"name\":\"上海\"},{\"id\":2,\"name\":\"闵行\"},{\"id\":3,\"name\":\"宝山\"},{\"id\":5,\"name\":\"嘉定\"},{\"id\":7,\"name\":\"金山\"},{\"id\":8,\"name\":\"青浦\"},{\"id\":9,\"name\":\"松江\"},{\"id\":10,\"name\":\"奉贤\"},{\"id\":11,\"name\":\"崇明\"},{\"id\":12,\"name\":\"徐家汇\"},{\"id\":13,\"name\":\"浦东\"},{\"id\":14,\"name\":\"黄浦\"},{\"id\":15,\"name\":\"长宁\"},{\"id\":16,\"name\":\"静安\"},{\"id\":17,\"name\":\"普陀\"},{\"id\":18,\"name\":\"闸北\"},{\"id\":19,\"name\":\"虹口\"},{\"id\":20,\"name\":\"杨浦\"}]}"
                                                           // 天津
                                                           + ",{\"id\":10103,\"data\":[{\"id\":1,\"name\":\"天津\"},{\"id\":2,\"name\":\"武清\"},{\"id\":3,\"name\":\"宝坻\"},{\"id\":4,\"name\":\"东丽\"},{\"id\":5,\"name\":\"西青\"},{\"id\":6,\"name\":\"北辰\"},{\"id\":7,\"name\":\"宁河\"},{\"id\":9,\"name\":\"静海\"},{\"id\":10,\"name\":\"津南\"},{\"id\":14,\"name\":\"蓟县\"},{\"id\":15,\"name\":\"和平\"},{\"id\":16,\"name\":\"河东\"},{\"id\":17,\"name\":\"河西\"},{\"id\":18,\"name\":\"南开\"},{\"id\":19,\"name\":\"河北\"},{\"id\":20,\"name\":\"红桥\"},{\"id\":21,\"name\":\"滨海新区\"}]}"
                                                           // 重庆
                                                           + ",{\"id\":10104,\"data\":[{\"id\":1,\"name\":\"重庆\"},{\"id\":2,\"name\":\"永川\"},{\"id\":3,\"name\":\"合川\"},{\"id\":4,\"name\":\"南川\"},{\"id\":5,\"name\":\"江津\"},{\"id\":6,\"name\":\"万盛\"},{\"id\":7,\"name\":\"渝北\"},{\"id\":8,\"name\":\"北碚\"},{\"id\":9,\"name\":\"巴南\"},{\"id\":10,\"name\":\"长寿\"},{\"id\":11,\"name\":\"黔江\"},{\"id\":13,\"name\":\"万州\"},{\"id\":14,\"name\":\"涪陵\"},{\"id\":15,\"name\":\"开县\"},{\"id\":16,\"name\":\"城口\"},{\"id\":17,\"name\":\"云阳\"},{\"id\":18,\"name\":\"巫溪\"},{\"id\":19,\"name\":\"奉节\"},{\"id\":20,\"name\":\"巫山\"},{\"id\":21,\"name\":\"潼南\"},{\"id\":22,\"name\":\"垫江\"},{\"id\":23,\"name\":\"梁平\"},{\"id\":24,\"name\":\"忠县\"},{\"id\":25,\"name\":\"石柱\"},{\"id\":26,\"name\":\"大足\"},{\"id\":27,\"name\":\"荣昌\"},{\"id\":28,\"name\":\"铜梁\"},{\"id\":29,\"name\":\"璧山\"},{\"id\":30,\"name\":\"丰都\"},{\"id\":31,\"name\":\"武隆\"},{\"id\":32,\"name\":\"彭水\"},{\"id\":33,\"name\":\"綦江\"},{\"id\":34,\"name\":\"酉阳\"},{\"id\":36,\"name\":\"秀山\"},{\"id\":37,\"name\":\"渝中\"},{\"id\":38,\"name\":\"大渡口\"},{\"id\":39,\"name\":\"江北\"},{\"id\":40,\"name\":\"沙坪坝\"},{\"id\":41,\"name\":\"九龙坡\"},{\"id\":42,\"name\":\"南岸\"},{\"id\":43,\"name\":\"两江新区\"},{\"id\":44,\"name\":\"双桥\"}]}"
                                                           // 黑龙江
                                                           + ",{\"id\":10105,\"data\":[{\"id\":1,\"name\":\"哈尔滨\"},{\"id\":2,\"name\":\"齐齐哈尔\"},{\"id\":3,\"name\":\"牡丹江\"},{\"id\":4,\"name\":\"佳木斯\"},{\"id\":5,\"name\":\"绥化\"},{\"id\":6,\"name\":\"黑河\"},{\"id\":7,\"name\":\"大兴安岭\"},{\"id\":8,\"name\":\"伊春\"},{\"id\":9,\"name\":\"大庆\"},{\"id\":10,\"name\":\"七台河\"},{\"id\":11,\"name\":\"鸡西\"},{\"id\":12,\"name\":\"鹤岗\"},{\"id\":13,\"name\":\"双鸭山\"}]}"
                                                           // 吉林
                                                           + ",{\"id\":10106,\"data\":[{\"id\":1,\"name\":\"长春\"},{\"id\":2,\"name\":\"吉林\"},{\"id\":3,\"name\":\"延边\"},{\"id\":4,\"name\":\"四平\"},{\"id\":5,\"name\":\"通化\"},{\"id\":6,\"name\":\"白城\"},{\"id\":7,\"name\":\"辽源\"},{\"id\":8,\"name\":\"松原\"},{\"id\":9,\"name\":\"白山\"}]}"
                                                           // 辽宁
                                                           + ",{\"id\":10107,\"data\":[{\"id\":1,\"name\":\"沈阳\"},{\"id\":2,\"name\":\"大连\"},{\"id\":3,\"name\":\"鞍山\"},{\"id\":4,\"name\":\"抚顺\"},{\"id\":5,\"name\":\"本溪\"},{\"id\":6,\"name\":\"丹东\"},{\"id\":7,\"name\":\"锦州\"},{\"id\":8,\"name\":\"营口\"},{\"id\":9,\"name\":\"阜新\"},{\"id\":10,\"name\":\"辽阳\"},{\"id\":11,\"name\":\"铁岭\"},{\"id\":12,\"name\":\"朝阳\"},{\"id\":13,\"name\":\"盘锦\"},{\"id\":14,\"name\":\"葫芦岛\"}]}"
                                                           // 内蒙古
                                                           + ",{\"id\":10108,\"data\":[{\"id\":1,\"name\":\"呼和浩特\"},{\"id\":2,\"name\":\"包头\"},{\"id\":3,\"name\":\"乌海\"},{\"id\":4,\"name\":\"乌兰察布\"},{\"id\":5,\"name\":\"通辽\"},{\"id\":6,\"name\":\"赤峰\"},{\"id\":7,\"name\":\"鄂尔多斯\"},{\"id\":8,\"name\":\"巴彦淖尔\"},{\"id\":9,\"name\":\"锡林郭勒\"},{\"id\":10,\"name\":\"呼伦贝尔\"},{\"id\":11,\"name\":\"兴安盟\"},{\"id\":12,\"name\":\"阿拉善盟\"}]}"
                                                           // 河北
                                                           + ",{\"id\":10109,\"data\":[{\"id\":1,\"name\":\"石家庄\"},{\"id\":2,\"name\":\"保定\"},{\"id\":3,\"name\":\"张家口\"},{\"id\":4,\"name\":\"承德\"},{\"id\":5,\"name\":\"唐山\"},{\"id\":6,\"name\":\"廊坊\"},{\"id\":7,\"name\":\"沧州\"},{\"id\":8,\"name\":\"衡水\"},{\"id\":9,\"name\":\"邢台\"},{\"id\":10,\"name\":\"邯郸\"},{\"id\":11,\"name\":\"秦皇岛\"}]}"
                                                           // 山西
                                                           + ",{\"id\":10110,\"data\":[{\"id\":1,\"name\":\"太原\"},{\"id\":2,\"name\":\"大同\"},{\"id\":3,\"name\":\"阳泉\"},{\"id\":4,\"name\":\"晋中\"},{\"id\":5,\"name\":\"长治\"},{\"id\":6,\"name\":\"晋城\"},{\"id\":7,\"name\":\"临汾\"},{\"id\":8,\"name\":\"运城\"},{\"id\":9,\"name\":\"朔州\"},{\"id\":10,\"name\":\"忻州\"},{\"id\":11,\"name\":\"吕梁\"}]}"
                                                           // 陕西
                                                           + ",{\"id\":10111,\"data\":[{\"id\":1,\"name\":\"西安\"},{\"id\":2,\"name\":\"咸阳\"},{\"id\":3,\"name\":\"延安\"},{\"id\":4,\"name\":\"榆林\"},{\"id\":6,\"name\":\"商洛\"},{\"id\":7,\"name\":\"安康\"},{\"id\":8,\"name\":\"汉中\"},{\"id\":9,\"name\":\"宝鸡\"},{\"id\":10,\"name\":\"铜川\"},{\"id\":11,\"name\":\"杨凌\"}]}"
                                                           // 山东
                                                           + ",{\"id\":10112,\"data\":[{\"id\":1,\"name\":\"济南\"},{\"id\":2,\"name\":\"青岛\"},{\"id\":3,\"name\":\"淄博\"},{\"id\":4,\"name\":\"德州\"},{\"id\":5,\"name\":\"烟台\"},{\"id\":6,\"name\":\"潍坊\"},{\"id\":7,\"name\":\"济宁\"},{\"id\":8,\"name\":\"泰安\"},{\"id\":9,\"name\":\"临沂\"},{\"id\":10,\"name\":\"菏泽\"},{\"id\":11,\"name\":\"滨州\"},{\"id\":12,\"name\":\"东营\"},{\"id\":13,\"name\":\"威海\"},{\"id\":14,\"name\":\"枣庄\"},{\"id\":15,\"name\":\"日照\"},{\"id\":16,\"name\":\"莱芜\"},{\"id\":17,\"name\":\"聊城\"}]}"
                                                           // 新疆
                                                           + ",{\"id\":10113,\"data\":[{\"id\":1,\"name\":\"乌鲁木齐\"},{\"id\":2,\"name\":\"克拉玛依\"},{\"id\":3,\"name\":\"石河子\"},{\"id\":4,\"name\":\"昌吉\"},{\"id\":5,\"name\":\"吐鲁番\"},{\"id\":6,\"name\":\"巴州\"},{\"id\":7,\"name\":\"阿拉尔\"},{\"id\":8,\"name\":\"阿克苏\"},{\"id\":9,\"name\":\"喀什\"},{\"id\":10,\"name\":\"伊犁\"},{\"id\":11,\"name\":\"塔城\"},{\"id\":12,\"name\":\"哈密\"},{\"id\":13,\"name\":\"和田\"},{\"id\":14,\"name\":\"阿勒泰\"},{\"id\":15,\"name\":\"克州\"},{\"id\":16,\"name\":\"博州\"}]}"
                                                           // 西藏
                                                           + ",{\"id\":10114,\"data\":[{\"id\":1,\"name\":\"拉萨\"},{\"id\":2,\"name\":\"日喀则\"},{\"id\":3,\"name\":\"山南\"},{\"id\":4,\"name\":\"林芝\"},{\"id\":5,\"name\":\"昌都\"},{\"id\":6,\"name\":\"那曲\"},{\"id\":7,\"name\":\"阿里\"}]}"
                                                           // 青海
                                                           + ",{\"id\":10115,\"data\":[{\"id\":1,\"name\":\"西宁\"},{\"id\":2,\"name\":\"海东\"},{\"id\":3,\"name\":\"黄南\"},{\"id\":4,\"name\":\"海南\"},{\"id\":5,\"name\":\"果洛\"},{\"id\":6,\"name\":\"玉树\"},{\"id\":7,\"name\":\"海西\"},{\"id\":8,\"name\":\"海北\"},{\"id\":9,\"name\":\"格尔木\"}]}"
                                                           // 甘肃
                                                           + ",{\"id\":10116,\"data\":[{\"id\":1,\"name\":\"兰州\"},{\"id\":2,\"name\":\"定西\"},{\"id\":3,\"name\":\"平凉\"},{\"id\":4,\"name\":\"庆阳\"},{\"id\":5,\"name\":\"武威\"},{\"id\":6,\"name\":\"金昌\"},{\"id\":7,\"name\":\"张掖\"},{\"id\":8,\"name\":\"酒泉\"},{\"id\":9,\"name\":\"天水\"},{\"id\":10,\"name\":\"陇南\"},{\"id\":11,\"name\":\"临夏\"},{\"id\":12,\"name\":\"甘南\"},{\"id\":13,\"name\":\"白银\"},{\"id\":14,\"name\":\"嘉峪关\"}]}"
                                                           // 宁夏
                                                           + ",{\"id\":10117,\"data\":[{\"id\":1,\"name\":\"银川\"},{\"id\":2,\"name\":\"石嘴山\"},{\"id\":3,\"name\":\"吴忠\"},{\"id\":4,\"name\":\"固原\"},{\"id\":5,\"name\":\"中卫\"}]}"
                                                           // 河南
                                                           + ",{\"id\":10118,\"data\":[{\"id\":1,\"name\":\"郑州\"},{\"id\":2,\"name\":\"安阳\"},{\"id\":3,\"name\":\"新乡\"},{\"id\":4,\"name\":\"许昌\"},{\"id\":5,\"name\":\"平顶山\"},{\"id\":6,\"name\":\"信阳\"},{\"id\":7,\"name\":\"南阳\"},{\"id\":8,\"name\":\"开封\"},{\"id\":9,\"name\":\"洛阳\"},{\"id\":10,\"name\":\"商丘\"},{\"id\":11,\"name\":\"焦作\"},{\"id\":12,\"name\":\"鹤壁\"},{\"id\":13,\"name\":\"濮阳\"},{\"id\":14,\"name\":\"周口\"},{\"id\":15,\"name\":\"漯河\"},{\"id\":16,\"name\":\"驻马店\"},{\"id\":17,\"name\":\"三门峡\"},{\"id\":18,\"name\":\"济源\"}]}"
                                                           // 江苏
                                                           + ",{\"id\":10119,\"data\":[{\"id\":1,\"name\":\"南京\"},{\"id\":2,\"name\":\"无锡\"},{\"id\":3,\"name\":\"镇江\"},{\"id\":4,\"name\":\"苏州\"},{\"id\":5,\"name\":\"南通\"},{\"id\":6,\"name\":\"扬州\"},{\"id\":7,\"name\":\"盐城\"},{\"id\":8,\"name\":\"徐州\"},{\"id\":9,\"name\":\"淮安\"},{\"id\":10,\"name\":\"连云港\"},{\"id\":11,\"name\":\"常州\"},{\"id\":12,\"name\":\"泰州\"},{\"id\":13,\"name\":\"宿迁\"}]}"
                                                           // 湖北
                                                           + ",{\"id\":10120,\"data\":[{\"id\":1,\"name\":\"武汉\"},{\"id\":2,\"name\":\"襄阳\"},{\"id\":3,\"name\":\"鄂州\"},{\"id\":4,\"name\":\"孝感\"},{\"id\":5,\"name\":\"黄冈\"},{\"id\":6,\"name\":\"黄石\"},{\"id\":7,\"name\":\"咸宁\"},{\"id\":8,\"name\":\"荆州\"},{\"id\":9,\"name\":\"宜昌\"},{\"id\":10,\"name\":\"恩施\"},{\"id\":11,\"name\":\"十堰\"},{\"id\":12,\"name\":\"神农架\"},{\"id\":13,\"name\":\"随州\"},{\"id\":14,\"name\":\"荆门\"},{\"id\":15,\"name\":\"天门\"},{\"id\":16,\"name\":\"仙桃\"},{\"id\":17,\"name\":\"潜江\"}]}"
                                                           // 浙江
                                                           + ",{\"id\":10121,\"data\":[{\"id\":1,\"name\":\"杭州\"},{\"id\":2,\"name\":\"湖州\"},{\"id\":3,\"name\":\"嘉兴\"},{\"id\":4,\"name\":\"宁波\"},{\"id\":5,\"name\":\"绍兴\"},{\"id\":6,\"name\":\"台州\"},{\"id\":7,\"name\":\"温州\"},{\"id\":8,\"name\":\"丽水\"},{\"id\":9,\"name\":\"金华\"},{\"id\":10,\"name\":\"衢州\"},{\"id\":11,\"name\":\"舟山\"}]}"
                                                           // 安徽
                                                           + ",{\"id\":10122,\"data\":[{\"id\":1,\"name\":\"合肥\"},{\"id\":2,\"name\":\"蚌埠\"},{\"id\":3,\"name\":\"芜湖\"},{\"id\":4,\"name\":\"淮南\"},{\"id\":5,\"name\":\"马鞍山\"},{\"id\":6,\"name\":\"安庆\"},{\"id\":7,\"name\":\"宿州\"},{\"id\":8,\"name\":\"阜阳\"},{\"id\":9,\"name\":\"亳州\"},{\"id\":10,\"name\":\"黄山\"},{\"id\":11,\"name\":\"滁州\"},{\"id\":12,\"name\":\"淮北\"},{\"id\":13,\"name\":\"铜陵\"},{\"id\":14,\"name\":\"宣城\"},{\"id\":15,\"name\":\"六安\"},{\"id\":16,\"name\":\"巢湖\"},{\"id\":17,\"name\":\"池州\"}]}"
                                                           // 福建
                                                           + ",{\"id\":10123,\"data\":[{\"id\":1,\"name\":\"福州\"},{\"id\":2,\"name\":\"厦门\"},{\"id\":3,\"name\":\"宁德\"},{\"id\":4,\"name\":\"莆田\"},{\"id\":5,\"name\":\"泉州\"},{\"id\":6,\"name\":\"漳州\"},{\"id\":7,\"name\":\"龙岩\"},{\"id\":8,\"name\":\"三明\"},{\"id\":9,\"name\":\"南平\"}]}"
                                                           // 江西
                                                           + ",{\"id\":10124,\"data\":[{\"id\":1,\"name\":\"南昌\"},{\"id\":2,\"name\":\"九江\"},{\"id\":3,\"name\":\"上饶\"},{\"id\":4,\"name\":\"抚州\"},{\"id\":5,\"name\":\"宜春\"},{\"id\":6,\"name\":\"吉安\"},{\"id\":7,\"name\":\"赣州\"},{\"id\":8,\"name\":\"景德镇\"},{\"id\":9,\"name\":\"萍乡\"},{\"id\":10,\"name\":\"新余\"},{\"id\":11,\"name\":\"鹰潭\"}]}"
                                                           // 湖南
                                                           + ",{\"id\":10125,\"data\":[{\"id\":1,\"name\":\"长沙\"},{\"id\":2,\"name\":\"湘潭\"},{\"id\":3,\"name\":\"株洲\"},{\"id\":4,\"name\":\"衡阳\"},{\"id\":5,\"name\":\"郴州\"},{\"id\":6,\"name\":\"常德\"},{\"id\":7,\"name\":\"益阳\"},{\"id\":8,\"name\":\"娄底\"},{\"id\":9,\"name\":\"邵阳\"},{\"id\":10,\"name\":\"岳阳\"},{\"id\":11,\"name\":\"张家界\"},{\"id\":12,\"name\":\"怀化\"},{\"id\":14,\"name\":\"永州\"},{\"id\":15,\"name\":\"湘西\"}]}"
                                                           // 贵州
                                                           + ",{\"id\":10126,\"data\":[{\"id\":1,\"name\":\"贵阳\"},{\"id\":2,\"name\":\"遵义\"},{\"id\":3,\"name\":\"安顺\"},{\"id\":4,\"name\":\"黔南\"},{\"id\":5,\"name\":\"黔东南\"},{\"id\":6,\"name\":\"铜仁\"},{\"id\":7,\"name\":\"毕节\"},{\"id\":8,\"name\":\"六盘水\"},{\"id\":9,\"name\":\"黔西南\"}]}"
                                                           // 四川
                                                           + ",{\"id\":10127,\"data\":[{\"id\":1,\"name\":\"成都\"},{\"id\":2,\"name\":\"攀枝花\"},{\"id\":3,\"name\":\"自贡\"},{\"id\":4,\"name\":\"绵阳\"},{\"id\":5,\"name\":\"南充\"},{\"id\":6,\"name\":\"达州\"},{\"id\":7,\"name\":\"遂宁\"},{\"id\":8,\"name\":\"广安\"},{\"id\":9,\"name\":\"巴中\"},{\"id\":10,\"name\":\"泸州\"},{\"id\":11,\"name\":\"宜宾\"},{\"id\":12,\"name\":\"内江\"},{\"id\":13,\"name\":\"资阳\"},{\"id\":14,\"name\":\"乐山\"},{\"id\":15,\"name\":\"眉山\"},{\"id\":16,\"name\":\"凉山\"},{\"id\":17,\"name\":\"雅安\"},{\"id\":18,\"name\":\"甘孜\"},{\"id\":19,\"name\":\"阿坝\"},{\"id\":20,\"name\":\"德阳\"},{\"id\":21,\"name\":\"广元\"}]}"
                                                           // 广东
                                                           + ",{\"id\":10128,\"data\":[{\"id\":1,\"name\":\"广州\"},{\"id\":2,\"name\":\"韶关\"},{\"id\":3,\"name\":\"惠州\"},{\"id\":4,\"name\":\"梅州\"},{\"id\":5,\"name\":\"汕头\"},{\"id\":6,\"name\":\"深圳\"},{\"id\":7,\"name\":\"珠海\"},{\"id\":8,\"name\":\"佛山\"},{\"id\":9,\"name\":\"肇庆\"},{\"id\":10,\"name\":\"湛江\"},{\"id\":11,\"name\":\"江门\"},{\"id\":12,\"name\":\"河源\"},{\"id\":13,\"name\":\"清远\"},{\"id\":14,\"name\":\"云浮\"},{\"id\":15,\"name\":\"潮州\"},{\"id\":16,\"name\":\"东莞\"},{\"id\":17,\"name\":\"中山\"},{\"id\":18,\"name\":\"阳江\"},{\"id\":19,\"name\":\"揭阳\"},{\"id\":20,\"name\":\"茂名\"},{\"id\":21,\"name\":\"汕尾\"}]}"
                                                           // 云南
                                                           + ",{\"id\":10129,\"data\":[{\"id\":1,\"name\":\"昆明\"},{\"id\":2,\"name\":\"大理\"},{\"id\":3,\"name\":\"红河\"},{\"id\":4,\"name\":\"曲靖\"},{\"id\":5,\"name\":\"保山\"},{\"id\":6,\"name\":\"文山\"},{\"id\":7,\"name\":\"玉溪\"},{\"id\":8,\"name\":\"楚雄\"},{\"id\":9,\"name\":\"普洱\"},{\"id\":10,\"name\":\"昭通\"},{\"id\":11,\"name\":\"临沧\"},{\"id\":12,\"name\":\"怒江\"},{\"id\":13,\"name\":\"迪庆\"},{\"id\":14,\"name\":\"丽江\"},{\"id\":15,\"name\":\"德宏\"},{\"id\":16,\"name\":\"西双版纳\"}]}"
                                                           // 广西
                                                           + ",{\"id\":10130,\"data\":[{\"id\":1,\"name\":\"南宁\"},{\"id\":2,\"name\":\"崇左\"},{\"id\":3,\"name\":\"柳州\"},{\"id\":4,\"name\":\"来宾\"},{\"id\":5,\"name\":\"桂林\"},{\"id\":6,\"name\":\"梧州\"},{\"id\":7,\"name\":\"贺州\"},{\"id\":8,\"name\":\"贵港\"},{\"id\":9,\"name\":\"玉林\"},{\"id\":10,\"name\":\"百色\"},{\"id\":11,\"name\":\"钦州\"},{\"id\":12,\"name\":\"河池\"},{\"id\":13,\"name\":\"北海\"},{\"id\":14,\"name\":\"防城港\"}]}"
                                                           // 海南
                                                           + ",{\"id\":10131,\"data\":[{\"id\":0,\"name\":\"海口\"},{\"id\":1,\"name\":\"白沙\"},{\"id\":2,\"name\":\"保亭\"},{\"id\":3,\"name\":\"昌江\"},{\"id\":4,\"name\":\"澄迈\"},{\"id\":5,\"name\":\"定安\"},{\"id\":6,\"name\":\"东方\"},{\"id\":7,\"name\":\"儋州\"},{\"id\":8,\"name\":\"乐东\"},{\"id\":9,\"name\":\"临高\"},{\"id\":10,\"name\":\"临水\"},{\"id\":11,\"name\":\"南沙岛\"},{\"id\":12,\"name\":\"琼海\"},{\"id\":13,\"name\":\"琼中\"},{\"id\":14,\"name\":\"三亚\"},{\"id\":15,\"name\":\"屯昌\"},{\"id\":16,\"name\":\"万宁\"},{\"id\":17,\"name\":\"文昌\"},{\"id\":18,\"name\":\"五指山\"},{\"id\":19,\"name\":\"西沙\"}]}"
                                                           // 香港
                                                           + ",{\"id\":10132,\"data\":[{\"id\":1,\"name\":\"香港\"}]}"
                                                           // 澳门
                                                           + ",{\"id\":10133,\"data\":[{\"id\":1,\"name\":\"澳门\"}]}"
                                                           // 台湾
                                                           + ",{\"id\":10134,\"data\":[{\"id\":1,\"name\":\"台北\"},{\"id\":2,\"name\":\"高雄\"},{\"id\":4,\"name\":\"台中\"}]}"
                                                           // 结尾
                                                           + "]";

    final static Map<Integer, List<CityMeta>> map  = parse(CITY);

    public static List<CityMeta> getCityById(Integer id) {
        return map.get(id);
    }

    private static Map<Integer, List<CityMeta>> parse(String json) {
        final Gson gson = new GsonBuilder().registerTypeAdapter(Double.class, new JsonSerializer<Double>() {

            @Override
            public JsonElement serialize(Double src, Type typeOfSrc, JsonSerializationContext context) {
                Integer value = src.intValue();
                return new JsonPrimitive(value);
            }
        }).create();
        List<?> list = gson.fromJson(json, new TypeToken<Object>() {
        }.getType());
        if (list == null || list.size() == 0) {
            return Collections.emptyMap();
        }
        Map<Integer, List<CityMeta>> map = new HashMap<Integer, List<CityMeta>>();
        for (Object obj : list) {
            if (obj == null) {
                continue;
            }
            if (obj instanceof Map<?, ?>) {
                Number parentId = (Number) ((Map<?, ?>) obj).get("id");
                Integer pId = parentId.intValue();
                List<?> data = (List<?>) ((Map<?, ?>) obj).get("data");
                if (parentId == null || data == null) {
                    continue;
                }
                List<CityMeta> cityList = new ArrayList<CityUtils.CityMeta>();
                for (Object value : data) {
                    if (value instanceof Map<?, ?>) {
                        cityList.add(new CityMeta((Double) ((Map<?, ?>) value).get("id"),
                                                  (String) ((Map<?, ?>) value).get("name")));
                    }
                }
                map.put(pId, cityList);
            }
        }
        return map;
    }

    public static class CityMeta {

        private Integer id;
        private String  name;

        public CityMeta(Double id, String name) {
            this.id = (int) Math.round(id);
            this.name = name;
        }

        public Integer getId() {
            return id;
        }

        public void setId(Integer id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }
    }
}
